In [1]:
%pip install numpy pandas

Requirement already satisfied: numpy in c:\users\germa\appdata\local\programs\python\python311\lib\site-packages (2.1.1)
Requirement already satisfied: pandas in c:\users\germa\appdata\local\programs\python\python311\lib\site-packages (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\germa\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\germa\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\germa\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\germa\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [24]:
import numpy as np
import pandas as pd

In [37]:
df = pd.read_csv(r"C:\Users\germa\Documents\GitHub\Data-Science---Salary-\data\ds_salaries.csv")

In [33]:
df.head(3) #Just to check if data is correctly uploaded

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S

In [45]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [38]:
df.shape # To see dimensions

(3755, 11)

In [40]:
df.dtypes

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

In [41]:
df.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

DATA PRE PROCESSING

In [44]:
df.duplicated().sum() # 1171 files are duplicated

np.int64(1171)

In [47]:
duplicated_files = df[df.duplicated(keep=False)]
duplicated_files

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
5,2023,SE,FT,Applied Scientist,222200,USD,222200,US,0,US,L
6,2023,SE,FT,Applied Scientist,136000,USD,136000,US,0,US,L
9,2023,SE,FT,Data Scientist,147100,USD,147100,US,0,US,M
10,2023,SE,FT,Data Scientist,90700,USD,90700,US,0,US,M
11,2023,SE,FT,Data Analyst,130000,USD,130000,US,100,US,M
...,...,...,...,...,...,...,...,...,...,...,...
3441,2022,SE,FT,Data Engineer,115000,USD,115000,US,100,US,M
3502,2021,MI,FT,Data Engineer,200000,USD,200000,US,100,US,L
3586,2021,MI,FT,Data Engineer,200000,USD,200000,US,100,US,L
3665,2021,MI,FT,Data Scientist,76760,EUR,90734,DE,50,DE,L
3709,2021,MI,FT,Data Scientist,76760,EUR,90734,DE,50,DE,L

In [50]:
duplicate_count = df.value_counts()
duplicated_files = duplicate_count[duplicate_count > 1]
duplicated_files

work_year  experience_level  employment_type  job_title           salary   salary_currency  salary_in_usd  employee_residence  remote_ratio  company_location  company_size
2022       SE                FT               Data Scientist      141525   USD              141525         US                  100           US                M               21
                                                                  191475   USD              191475         US                  100           US                M               21
2023       SE                FT               Data Engineer       252000   USD              252000         US                  0             US                M               13
                                                                  129000   USD              129000         US                  0             US                M               13
2022       SE                FT               Data Engineer       130000   USD              130000         US                  0             US                M               12
                                                                                                                                                                               ..
                                              Data Scientist      92000    USD              92000          US                  100           US                L                2
2023       EX                FT               Data Engineer       235000   USD              235000         US                  0             US                M                2
           EN                FT               Research Engineer   155000   USD              155000         US                  0             US                M                2
           SE                FT               Research Scientist  253750   USD              253750         ES                  0             ES                M                2
2020       EN                FT               Data Engineer       1000000  INR              13493          IN                  100           IN                L                2
Name: count, Length: 544, dtype: int64

ERRASING DUPLICATED DATA

In [51]:
df.drop_duplicates(inplace = True)

In [52]:
df.shape

(2584, 11)

EDA

In [53]:
df.head(1)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L

¿De que país son la mayoría de compañías?

¿En que puesto se ganás mas dinero?

In [72]:
df.groupby("job_title").agg({"salary_in_usd":"mean"}).round(2).sort_values(by=["salary_in_usd"],ascending=False)

                               salary_in_usd
job_title
Data Science Tech Lead             375000.00
Cloud Data Architect               250000.00
Data Lead                          212500.00
Data Analytics Lead                211254.50
Principal Data Scientist           198171.12
...                                      ...
Autonomous Vehicle Technician       26277.50
3D Computer Vision Researcher       21352.25
Staff Data Analyst                  15000.00
Product Data Scientist               8000.00
Power BI Developer                   5409.00

[93 rows x 1 columns]

¿Pais donde más se cobra?

Cuanto se cobra por nivel de experiencia en promedio